app/views/movies/show.html.erb

  <p>
    Read all <%= link_to pluralize(@movie.reviews.size, "review"), movie_reviews_path(@movie) %>
---
SELECT COUNT(*) FROM "reviews" WHERE "reviews"."movie_id" = ?  [["movie_id", 1]]


  <% if @movie.reviews.any? %>
---
SELECT 1 AS one FROM "reviews" WHERE "reviews"."movie_id" = ? LIMIT 1  [["movie_id", 1]]